# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

import random

array = [random.randint(-20, 20) for i in range(20)]
# array = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print(array)
array2 = []

max_n = int(input('Введите max: '))
min_n = int(input('Введите min: '))

for i in range(len(array)):
    if min_n <= array[i] <= max_n:
        array2.append(i)
print(array2)
